storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
140
(
(-0.00215304349017811 -2.2986493461502e-06 0)
(-0.00210234136514145 -4.18111706722205e-06 0)
(-0.00200876189108308 -4.68266934079496e-06 0)
(-0.00189629049839483 -5.16521097024689e-06 0)
(-0.00176597856433179 -7.02662810297655e-06 8.77715685863143e-39)
(-0.00164336883169155 -1.15089140547775e-05 0)
(-0.00154992285176517 -1.92466700799288e-05 6.42469696963552e-21)
(-0.00148592395329497 -3.02311104901112e-05 3.67341984631965e-40)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
140
(
(-0.00219701249144942 -4.95529122844354e-07 0)
(-0.00223024556289815 -9.51784287602677e-07 0)
(-0.00227569303017924 -1.09311997772551e-06 0)
(-0.00232800656609144 -1.23537462024129e-06 0)
(-0.00238742374315693 -1.3639627673997e-06 0)
(-0.00245294261205614 -1.48073998992583e-06 0)
(-0.00252430439656738 -1.59827781224297e-06 0)
(-0.00260156883375385 -1.71850616181879e-06 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
